{"/_index-copy/":{"data":{"academic-background#Academic Background":" Master’s in Computer Science: My Master’s program provided the foundations of software engineering, with a strong focus on machine learning techniques. I also gained exposure to data processing, particularly for images and sound. Language study at University California San Diego to improve my English proficiency. Bachelor’s in Applied Statistics: During my Bachelor’s, I learned advanced statistics and cognitive sciences, which taught me the rigor of scientific experimentation. 📄 To download my CV, click on the French version or the English version.","benoit-boidin#Benoit Boidin":"Benoit Boidin I am Benoît, a young Frenchman passionate about AI and training machine learning models! This site showcases my background and professional experiences.\nLet’s work together on Malt.","experiences#Experiences":" Detection Neural Network (6 months): My final-year internship involved creating an artificial intelligence model for real-time ship recognition. New Type of Search Engine (2 years): During my Master’s, I was the first student hired to collaborate with CNRS - LaBRI (Bordeaux Computer Science Research Laboratory), where I worked on creating a search engine using NLP and data extraction techniques. Breast Cancer Detection (2 months): This voluntary internship focused on analyzing a framework for breast cancer detection through DNA and seeking improvements. 📄 Recommendations from my former supervisors and colleagues: letter by Hugo Gimbert (research professor at CNRS) and letter by Fabien Rhodes (operations director at MaxSea).","miscellaneous#Miscellaneous":"Connect with me on LinkedIn or GitHub!\nCheck out some posts I’ve published on LinkedIn.\nHere’s a representation of a dataset as a similarity map (embedding calculations, clustering, PCA):"},"title":"_index copy"},"/education/":{"data":{"formation#Formation":"","licence-de-statistiques-appliquées#Licence de Statistiques Appliquées":" Université Lumière Lyon 2\n2018 - 2021\nLa spécificité de la Licence mention MIASHS est de proposer aux étudiant.es de se former tout au long de ses trois années à la pluridisciplinarité en combinant des connaissances théoriques et pratiques des Sciences Humaines et Sociales (SHS) et des enseignements de Mathématiques, Informatique et Statistiques (MIS). Dès le premier semestre de L1, chaque étudiant.e choisit une SHS parmi six possibilités et la poursuit tout au long de la Licence : Parcours MIASHS - Géographie et Aménagement ou Parcours MIASHS - Histoire ou Parcours MIASHS - Psychologie ou Parcours MIASHS - Science du Langage ou Parcours MIASHS - Sciences Cognitives ou Parcours MIASHS - Sociologie. Quel que soit le parcours, l’objectif principal est de donner aux étudiant.es une double compétence, une dans la SHS choisie et l’autre en outils de modélisation et de traitement des données. L’enseignement, essentiellement appliqué, se caractérise par une interconnexion forte entre d’une part les contenus et les besoins des SHS et d’autre part les modélisations et traitements par des outils mathématiques et informatiques.\nActivités et associations : Aide aux étudiants en difficultés et années inférieures en association avec d’autres élèves de la promotion.","master-en-informatique#Master en informatique":"FormationMaster en informatique Université de Bordeaux\n2022 - 2024\nL’image et le son numériques sont omniprésents dans notre environnement quotidien qu’il soit professionnel ou privé. Jeu vidéo, vidéo protection, recommandation musicale et génération de playlist, analyse d’image médicale, réalité virtuelle, réalité augmentée, autant d’exemples d’applications que nous pouvons rencontrer. Pour être acteur de ces développements et contribuer aux innovations dans ces domaines, il est indispensable de se spécialiser et d’acquérir des compétences spécifiques.\nLe parcours “Informatique pour l’Image et le Son” répond à ce besoin et permet aux étudiants de compléter leur formation générale en informatique en approfondissant les sujets suivants : mondes numériques 3D, traitement des images et des vidéos, son et musique numériques, interaction homme/machine, vision artificielle… Il débouche sur le métier d’ingénieur en informatique, spécialisé dans l’image et le son numériques, et permet de travailler au développement d’applications logicielles ainsi que pour la R\u0026D des entreprises de ces domaines. Il permet également une poursuite d’étude en thèse."},"title":"education"},"/experiences/":{"data":{"2021#2021":" Internship at ERIC CS lab, with a inferential statistics researcher in Lyon, France. ","2023#2023":" Internship, fixed term contract and freelancing at CBRS - LaBRI, computer science research lab. ","2024#2024":" Internship at MaxSea International, I created a training pipeline from scratch for train a boat detection neural network. ","expériences#Expériences":"Expériences Here are listed my professional experiences."},"title":"_index"},"/experiences/ml_boat/":{"data":{"1-data-gathering#1. Data gathering":"Improving YOLOX performance started by creating a boat detection dataset. I managed to gather more than 110 000 images with about 290 000 ships.\nBy exploring the dataset with FiftyOne, I detected some duplicates and similar images. Thanks to embeddings, I created a similarity filter that I used to avoir overfitting.","2-visualization-and-statistics#2. Visualization and statistics":"Embeddings allowed me to go deeper into the dataset: I detected clusters of unwanted objects like submarines. I computed statistics on detection size, image dimensions and number of objects per class of boat (to avoid unbalaced categories).","3-clustering-and-annotation#3. Clustering and annotation":"To allow the model to classify boats, I labelled the dataset. I used the embeddings and clustering wich allowed me to quickly sort data.","4-training#4. Training":"To rapidly iterate over experiments, I automated the training pipeline. The pipeline contained data filters, YOLOX paramters, logs and training results backup.\nEverything was automated to the team could launch a full training based on a single json file and bash script.","5-quantization#5. Quantization":"To allow YOLOX to work real time, I used OpenVINO to quantized every model and optimize it for Intel CPUs. The improvement was above 45% per frame.","6-performances-and-tests#6. Performances and tests":"To create a solid knowledge based for my successor, I logged every training and create clear reports of my work. The next data scientist could easily work on the project right after me and didn’t need mush time to get to know the processes.\n📄 This internship is described in my memoire.\nHere are the results of a model I trained. Other smaller models were traing in order to be less ressources heavy.\nTo efficiently annotate datasets, I used embeddings and FiftyOne. I then created similarity maps :\nHere are ships detected as fireboats :","maxsea#MaxSea":"MaxSea Machine Learning Specialist • april 2024 - september 2024 (6 month)\nInternship • Bidart, Nouvelle-Aquitaine, France\nNeural network (YOLOX) training for real time ship detection and tracking."},"title":"ml_boat"},"/experiences/monprojetsup/":{"data":{"laboratoire-bordelais-de-recherche-en-informatique-labri#Laboratoire Bordelais de Recherche en Informatique (LaBRI)":"Laboratoire Bordelais de Recherche en Informatique (LaBRI) Développeur Back End • September 2023 - January 2024 (5 months)\nFreelance • Remote\nFullstack developper on MonProjetSup. Working on Java server and UI (prototyping with CSS, Bootstrap).\nFullstack developper (with data science tasks) • May 2022 - September 2023 (1 year)\nCDD • Bordeaux, Nouvelle-Aquitaine, France\nWorking on a search engine with Natural Language Processing tasks. Keyword extraction from college degree descriptions. Web development and integration.\nData Scientist • May 2022 - September 2023 (3 months)\nStage • Bordeaux, Nouvelle-Aquitaine, France\nSVM performance assesment. The algorithm’s goal was to predict candidate admissibility to college (through ParcourSup). Goal is to avoid type 1 errors.\nDuring these experiences, I learned various skills like creating video subtitles and use Figma."},"title":"monprojetsup"},"/experiences/pertinint/":{"data":{"eric-laboratory#ERIC Laboratory":"ERIC Laboratory Python Developper • January 2022 - March 2023 (3 months)\nStage • Lyon, Rhône-Alpes, France\nImprovement of PertInInt, a genetic cancer identification framework so it can work in the gaussian case.\nHere is a mindmap I created to better understand the framework :\nThis browser does not support PDFs. Please download the PDF to view it: Download PDF."},"title":"pertinint"},"/posts/":{"data":{"posts#Posts":"Posts Theses posts are also available on my LinkedIn profile\nI spent 6 month looking at boats…\nI classified 119 536 ships in a week…\nI helped to create MonProjetSup…"},"title":"_index"},"/posts/identification/":{"data":{"i-classified-119-536-ships-in-a-week#I classified 119 536 ships in a week\u0026hellip;":"I classified 119 536 ships in a week…(and I even had spare time)\nDuring my internship at MaxSea, I trained a neural network on thousand of images.\nThe issue was… They all had a different label.\n“Boat”, “ship”, “vessel”, or even “small-tug-distant-blurry” : I couldn’t mix everything without the model precision collapsing.\nWhat did I do then? I classified every single image using one of the best ML tools: embeddings.\nWhat is it? It’s like a numbers list (a vector) which describes and image in a way a computer can understand.\nWhat if two embeddings contains almost the same numbers? Then the images are probably almost identical.\nThanks to this (and some clustering and dimension reduction), we can create a map.\nThen I just had to select points and give a category to the images! (Here are some fireboats)"},"title":"identification"},"/posts/look_at_boats/":{"data":{"i-spent-6-months-looking-at-boats#I spent 6 months looking at boats\u0026hellip;":"I spent 6 months looking at boats…(and I hope to find a job with that)\n✅ MaxSea International sells a marine surveillance software with camera management.\n❌ What they don’t sell is someone looking at the camera screens 24/7.\nSo here I came with some machine learning knowledge.\nIt took me 3 steps to solve their issue:\ngather thousand of boat pictures ; classify it with clustering ; train a detection neural network. The result? Model precision augmented by 45%.\nAnd it’s real time (thanks to quantization).\nI am know looking for a new opportunity to challenge me and bring my knowledge to an organisation that need innovation and teamm work.\nThanks to the MaxSea team for this collaboration!"},"title":"look_at_boats"},"/posts/monprojetsup/":{"data":{"i-helped-to-create-monprojetsup#I helped to create MonProjetSup\u0026hellip;":"J’ai participé à créer MonProjetSup…I helped to create MonProjetSup…(because of gender and social inequality)\nDuring my CS Master degree, I had the chance to be hired by the developper of ParcourSup.\n✅ This algorithm is extremely helpful.\n❌ However, this paper desmonstrate it’s not enough.\nWomen and lower social class student tend to under estimate their competences.\nThe result: they don’t apply to some university, even if they could.\nThe solution? MonProjetSup (Beta version).\nThis prototype is basically a personnalized search engine.\nIt allows student to esimate their chances of success thanks to metrics like last years admissions.\nWhy is this feedback needed? That’s what I asked the paper authors.\nTheir response: information help reduce significatively the influence of self trust:\nby 72 for gender inequality ; by 95 for social inequality. ","jai-participé-à-créer-monprojetsup#J\u0026rsquo;ai participé à créer MonProjetSup\u0026hellip;":""},"title":"monprojetsup"}}