{"/education/":{"data":{"formation#Formation":"","licence-de-statistiques-appliquées#Licence de Statistiques Appliquées":" Université Lumière Lyon 2\n2018 - 2021\nLa spécificité de la Licence mention MIASHS est de proposer aux étudiant.es de se former tout au long de ses trois années à la pluridisciplinarité en combinant des connaissances théoriques et pratiques des Sciences Humaines et Sociales (SHS) et des enseignements de Mathématiques, Informatique et Statistiques (MIS). Dès le premier semestre de L1, chaque étudiant.e choisit une SHS parmi six possibilités et la poursuit tout au long de la Licence : Parcours MIASHS - Géographie et Aménagement ou Parcours MIASHS - Histoire ou Parcours MIASHS - Psychologie ou Parcours MIASHS - Science du Langage ou Parcours MIASHS - Sciences Cognitives ou Parcours MIASHS - Sociologie. Quel que soit le parcours, l’objectif principal est de donner aux étudiant.es une double compétence, une dans la SHS choisie et l’autre en outils de modélisation et de traitement des données. L’enseignement, essentiellement appliqué, se caractérise par une interconnexion forte entre d’une part les contenus et les besoins des SHS et d’autre part les modélisations et traitements par des outils mathématiques et informatiques.\nActivités et associations : Aide aux étudiants en difficultés et années inférieures en association avec d’autres élèves de la promotion.","master-en-informatique#Master en informatique":"FormationMaster en informatique Université de Bordeaux\n2022 - 2024\nL’image et le son numériques sont omniprésents dans notre environnement quotidien qu’il soit professionnel ou privé. Jeu vidéo, vidéo protection, recommandation musicale et génération de playlist, analyse d’image médicale, réalité virtuelle, réalité augmentée, autant d’exemples d’applications que nous pouvons rencontrer. Pour être acteur de ces développements et contribuer aux innovations dans ces domaines, il est indispensable de se spécialiser et d’acquérir des compétences spécifiques.\nLe parcours “Informatique pour l’Image et le Son” répond à ce besoin et permet aux étudiants de compléter leur formation générale en informatique en approfondissant les sujets suivants : mondes numériques 3D, traitement des images et des vidéos, son et musique numériques, interaction homme/machine, vision artificielle… Il débouche sur le métier d’ingénieur en informatique, spécialisé dans l’image et le son numériques, et permet de travailler au développement d’applications logicielles ainsi que pour la R\u0026D des entreprises de ces domaines. Il permet également une poursuite d’étude en thèse."},"title":"education"},"/experiences/":{"data":{"2021#2021":" Stage pour le laboratoire ERIC, avec un professeurs de statistiques inférentielles à Lyon. ","2023#2023":" Stage, CDD puis freelance pour le LaBRI, un laboratoire de recherche en informatique affilié au CNRS. ","2024#2024":" Stage chez MaxSea International, ou j’ai construit de A à Z un pipeline d’entraînement pour la détection de navires par réseaux de neurones. ","expériences#Expériences":"Expériences Ici sont répertoriées mes expériences professionnelles.\nElles permettent de comprendre la façon dont j’ai acquis mes compétences."},"title":"_index"},"/experiences/ml_boat/":{"data":{"maxsea#MaxSea":"MaxSea Machine Learning Specialist • avril 2024 - septembre 2024 (6 mois)\nStage • Bidart, Nouvelle-Aquitaine, France\nEntraînement d’un réseau de neurones (YOLOX) pour la détection temps réel de navires.\nRecherche de données Visualisation et statistiques Clustering et annotation Entraînement Quantization Tests de performances Ci-dessous le résultat d’un des modèles les plus précis. D’autres modèles plus léger ont été entraînés afin d’être utilisés sur des machines moins puissantes."},"title":"ml_boat"},"/experiences/monprojetsup/":{"data":{"laboratoire-bordelais-de-recherche-en-informatique-labri#Laboratoire Bordelais de Recherche en Informatique (LaBRI)":"Laboratoire Bordelais de Recherche en Informatique (LaBRI) Développeur Back End • septembre 2023 - janvier 2024 (5 mois)\nFreelance • Remote\nAide à la finalisation du prototype MonProjetSup. Développement du serveur de et de l’UI.\nDéveloppeur NLP • mai 2022 - septembre 2023 (1 an)\nCDD • Bordeaux, Nouvelle-Aquitaine, France\nCréation d’un moteur de recherche à l’aide de traitement du langage naturel (NLP). Extraction de mots-clés dans les descriptions des formations. Développement web et intégration de la solution de recherche.\nDéveloppeur Machine Learning • mai 2022 - septembre 2023 (3 mois)\nStage • Bordeaux, Nouvelle-Aquitaine, France\nÉvaluation de la performance d’un modèle de machine learning (SVM) visant à prédire l’admissibilité des candidats (Parcoursup) à l’enseignement supérieur. L’objectif du stage est d’interpréter l’indicateur fourni par le SVM et d’évaluer sa précision, tout en accordant une attention particulière aux erreurs de type 1 (surévaluation de l’admissibilité)."},"title":"monprojetsup"},"/experiences/pertinint/":{"data":{"laboratoire-eric#Laboratoire ERIC":"Laboratoire ERIC Développeur Python • janvier 2022 - mars 2023 (3 mois)\nStage • Lyon, Rhône-Alpes, France\nUn cadre intégratif récemment proposé par des chercheurs de l’Université de Princeton a permis d’identifier les gènes pertinents en repérant ceux dont les sites d’interaction ou autres sites fonctionnels sont enrichis en mutations somatiques dans les tumeurs. L’objectif du stage est d’analyser cette nouvelle méthode et d’enrichir le code associé de nouvelles fonctionnalités dans le cas non-Gaussien.\nVoici ci-après le résultat de mon analyse sous forme de mindmap :\nThis browser does not support PDFs. Please download the PDF to view it: Download PDF."},"title":"pertinint"},"/posts/":{"data":{"posts#Posts":"Posts Theses posts are also available on my LinkedIn profile\nJ’ai passé 6 mois à regarder des bateaux…\nJ’ai identifié 119 536 navires en une semaine…\nJ’ai participé à créer MonProjetSup…"},"title":"_index"},"/posts/identification/":{"data":{"jai-identifié-119-536-navires-en-une-semaine#J\u0026rsquo;ai identifié 119 536 navires en une semaine\u0026hellip;":"J’ai identifié 119 536 navires en une semaine…(et j’ai même eu du temps libre)\nLors de mon passage chez MaxSea, j’ai entraîné un réseau de neurones sur des milliers d’images.\nLe problème ? Elles avaient toutes un label différent.\n“Boat”, “ship”, “vessel”, ou même “small-tug-distant-blurry” : impossible de tout mélanger sans que les performances du modèle s’effondrent.\nJ’ai donc classifié moi-même chaque image, à l’aide d’un outil formidable, les embeddings.\nQu’est-ce que c’est ? Une liste de chiffres qui permettent de décrire une image à un ordinateur.\nSi deux embeddings ont presque les mêmes chiffres ? L’ordinateur en déduit que les images se ressemblent.\nGrâce à ça (et en ajoutant un peu d’ACP et de clustering), on peut créer une carte.\nPlus qu’à entourer les points et donner un nom aux images ! (ici, les bateaux-pompes)"},"title":"identification"},"/posts/look_at_boats/":{"data":{"jai-passé-6-mois-à-regarder-des-bateaux#J\u0026rsquo;ai passé 6 mois à regarder des bateaux\u0026hellip;":"J’ai passé 6 mois à regarder des bateaux…(et j’espère trouver un job grâce à ça)\n✅ MaxSea International propose un logiciel de surveillance maritime, qui inclut la gestion de caméras.\n❌ Ce qu’ils ne proposent pas, c’est quelqu’un qui reste éveillé 24/7 derrière l’écran pour surveiller l’océan.\nC’est ici que mes compétences en machine learning interviennent.\nEn 3 étapes, j’ai pu résoudre leur problème :\nrécolter des centaines de milliers d’images de navires ; les classifier grâce au clustering ; entraîner un réseau de neurones ; Le résultat ? La précision de leur modèle a augmenté de 45%.\nTout ceci en restant en dessous de 92 millisecondes par image (grâce à l’optimisation par quantization).\nJe suis maintenant à la recherche d’un nouveau défi et aimerais apporter mes compétences à une organisation qui valorise l’innovation et le travail en équipe.\nMerci à toute l’équipe de MaxSea pour leur collaboration et les bons moments passés ensemble !"},"title":"look_at_boats"},"/posts/monprojetsup/":{"data":{"jai-participé-à-créer-monprojetsup#J\u0026rsquo;ai participé à créer MonProjetSup\u0026hellip;":"J’ai participé à créer MonProjetSup…(à cause du genre et de la classe sociale)\nPendant mon Master en Informatique (2022/2024), j’ai eu la chance d’être embauché par le développeur de l’algorithme au cœur de ParcourSup.\n✅ Cette algorithme a, dans de nombreux cas, prouvé son utilité.\n❌ Mais selon cette étude, ça ne suffit pas.\nLes élèves féminins ou issus des classes sociales populaires ont largement tendance à sous-estimer leurs capacités.\nRésultat : ils ne postulent qu’à des formations qui ne reflètent pas leur vrai niveau.\nLa réponse à ce problème ? MonProjetSup (version Beta).\nLe prototype que nous avons créé pose les bases d’un moteur de recherche personnalisé pour chaque candidat.\nDe plus, il permet aux élèves d’estimer leurs chances de réussite grâce à des indicateurs comme les prérequis ou la moyennes des admis de l’année précédente.\nPourquoi ce feedback est important ? C’est la question que j’ai eu la chance de poser aux chercheurs.\nVoici leur réponse : l’information du rang permet de réduire significativement le rôle joué par la confiance en soi :\nde 72% pour les écart de genre ; de 95% pour les écart sociaux. "},"title":"monprojetsup"}}